[
{"main_url": "https://dailycoin.com/", "name_of_group": "Market News", "title": "Crypto Trader, Ben Armstrong Predicts that “Monster” Ethereum-Based Project Could Soar 500x", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "Crypto-trader and analyst, Ben Armstrong suggests that an Ethereum based project could skyrocket 500 times more", "\n", "He made this known on his YouTube channel to his 486,000 subscribers", "\n", "Ben Armstrong comments that he is keeping a close watch on a relatively unknown protocol that is guaranteed to make DeFi easier as it rewards investors with just a few clicks", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Crypto-currency investor, trader, and analyst, Ben Armstrong, has opined that a new Ethereum based project could skyrocket and earn investors up to a whopping 500 percent on their investment.", "\n", "Similarly, an Ethereum whale with the user name, 0x_b1, has noted that the ", "unpopular crypto", " yAxis (AXIS) would become the next yearn.finance YFI", "\n", "Armstrong made this known on his YouTube channel with over 486,000 subscribers. He stated that investors who made considerable gains from Dogecoin’s 1,000% price boost should be prepared for the next big thing.", "\n", "He explained that the success of Aave, yearn finance (YFI), and Synthetix (SNX) shows the interest of enterprises and retail investors in decentralized finance. Since its launch, Aave has made an insane 260x return on investment.", "\n", "Synthetix spiked", " by an astronomical 407x in less than a year. This is DeFi ladies and gentlemen and this is only the pre-game party.", "\n", "Commenting on the new protocol, Ben Armstrong stated;", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "It’s called APY.Finance and the ticker APY, a plug and play solution for investors which routes funds to the best yield farming strategies. One won’t have to search for options himself and worry about changing yield AKA returns. It’s all automated and is essentially an aggregator of DeFi.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "What’s more, he explained that this new project, APY.Finance, is already connected to all the leading DeFi protocols such as Uniswap (UNI), SushiSwap (SUSHI), Aave, Compound (COMP), yearn, Synthetix, dYdX, and more.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the Flipside", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "Jeremy Rubin, technical advisor to Stellar, a Bitcoin core Contributor believes that the collapse of ETH is inevitable.", "\n", "Several commentators have argues that ETH will forever play second fiddle to BTC and the emergence of newer coins with better features will ultimately see ETH struggle.", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The Features of APY.Finance That Makes It The Protocol Poised To Make The Next Big Leap", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Ben Armstrong believes APY.Finance will be the next thing that makes the giant leap because its users have the wide latitude to deposit a range of stable coins like Tether (USDT), USD Coin (USDC), and DAI, and then AI automatically scours the crypto space for the next low risk, high reward investment.", "\n", "Using API.Finance, fees for pool withdrawals, and charges on deposits are 7 times lower than all DeFi Platforms.", "\n", "Furthermore, Ben Armstrong argues that APY.Finance’s value is going to skyrocket because of its diverse and experienced team. Founded by Will Shanda, a veteran and a winner of several hackathons, this project is poised for massive success.", "\n", "Another member of the team is Chan-Ho Suh, a former quant developer for Capital One. Armstrong also believes that with the backing of Sam Bankman-Fried’s FTX exchange, the sky is the starting point for APY.Finance.", "\n", "With the ", "crypto and DeFi market on a parabolic rise", ", here’s our pick for the ", "top 10 crypto projects you should keep an eye out for in 2021", ".", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "February 16, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Market News", "title": "New York Mayoral Candidate, Andrew Yang, Plans to Make NYC a Bitcoin Hub", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "Andrew Yang pledges to transform New York City into a hub for crypto-currencies", "\n", "Previously, in his political campaign, he had accepted donations in the form of crypto-currencies", "\n", "He pledges to provide Americans with $1000 every month as universal basic income", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Andrew Yang, 46, who is running for the office of the Mayor of New York City has announced his intention to run for the seat of Mayor in New York City, a move which could see the financial capital of the world quickly become a hub for cryptocurrencies.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "New York to Become a Bitcoin Hub", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "He tweeted on his official Twitter handle that “As Mayor of NYC – the financial capital – I will invest in making the city a hub for BTC and other crypto-currencies”", "\n", "His buoyant plans for cryptocurrency and his intention to provide Americans with $1000 every month as a universal basic income has seen him leading the polls in the Democratic Party for the Mayoral race.", "\n", "Reaffirming his pledge in an interview with Bloomberg, Yang stated “People investing in these currencies are finding a way to do so and make use of their investments.” He also noted that “I don’t think that you could impede it with regulation if you tried.”", "\n", "The move from Andrew Yang is very similar to that of Miami’s Mayor, Francis Suarez, ", "who has announced that he is working on a city resolution that would bring Bitcoin to Miami’s balance sheet", ".", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Who is Andrew Yang – The Man, The Myth, The Legend?", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Andrew Yang, 46 was born to immigrants from Taiwan in New York. He attended Columbia Law School and had a short stint as a lawyer after moving to New York City. He quickly made the switch to lending his services to several startups during the dot-com boom and ultimately became the CEO of his own company – Venture for America.", "\n", "In 2020, he announced his intention to run for President under the Democratic Party with his mantra being the automation and calling for an institutional acceptance of crypto-currencies. His Presidential campaign went on to accept donations in crypto-currencies reaffirming his desire to see a nationwide acceptance.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the Flipside", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "The U.S. treasury secretary, Janet Yellen, has warned of an “explosion of risk” from criminals using digital technologies", "\n", "According to Yellen, the Covid-19 pandemic has made the problem worse, because it has moved more crime online", "\n", "She told a U.S. Treasury roundtable that cryptocurrencies held promise, but were too often used for crime", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The Heated New York Mayoral Elections", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Andrew Yang’s intentions of transforming NYC into a cryptocurrency hub have sparked heated debates with some Twitter users referring to Bitcoin as a Pyramid scheme while others argue that a stable society requires a stable currency.", "\n", "With the primaries elections slated for June 22, several prominent personalities have indicated their intention to run for office under the Democrat party. Scott Stringer (Current City Councillor),", "\n", "Eric Adams (Brooklyn Borough President), Maya Wiley, Shawn Donovan, amongst others. In the predominantly Democrat state, whoever clinches the primaries is most likely going to be the new Mayor of New York.", "\n", "Andrew Yang’s promotion of technology and his pledge to see a nationwide acceptance of bitcoin has endeared him to the young, tech-savvy population and has seen him leading early polls. In about five months, New York City might see new changes in its financial space which will provide a blueprint for the rest of the country to follow.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "February 15, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Bitcoin News", "title": "Tesla Has Driven Bitcoin to Nearly $44K", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "Tesla bought $1.5 billion worth of Bitcoins today", "\n", "The company plans to add BTC as a payment method for its electric cars", "\n", "Bitcoin price soared to new all-time highs within minutes", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Bitcoin has yet entered another milestone in its history. The world’s leading crypto jumped to new highs of ", "$43,978.25", " today a few hours ago, as seen on CoinMarketCap. The BTC spiked minutes after Tesla announced it had invested $1.5 billion in the pioneer digital coin.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Tesla entered BTC rally", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The electric car giant ", "disclosed", " in a filing with the Securities and Exchange Commission (SEC) today to acquire $1.5 billion worth of Bitcoins. Furthermore, the company mentioned its plans to add Bitcoins as a payment method for Tesla’s products in the near future.", "\n", "The company stated it has updated its investment policy this January to “provide us with more flexibility to further diversify and maximize returns on our cash that is not required to maintain adequate operating liquidity.”", "\n", "As part of the policy, Tesla invests a portion of its $19 billion reserves in digital assets, as well as into gold bullion, gold exchange-traded funds, and other assets that may be specified in the future.", "\n", "The filling says e-car manufacturer may hold digital assets “from time to time or long term”.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the flipside", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "Tesla’s CEO Elon Musk ", "has been playing", " Bitcoin and DogeCoin prices on Twitter the past few weeks by posting positive messages and driving the assets’ prices up.", "\n", "Bitcoin is still a highly volatile asset, the company warned about it in its SEC filing.", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "BTC price shot up", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Bitcoins price shot up to the new record highs moments after Tesla’s announcement. The BTC spiked by nearly 12% within a single hour and fixed the new all-time high of $43,978.25 on Monday afternoon UTC.", "\n", "For Bitcoin Tesla is the biggest investor, but certainly not the only one. There is a much broader base of institutional investors including Grayscale, MicroStrategy, MassMutual, and multiple other investors.", "\n", "The institutional shift towards Bitcoin started in 2020 when traditional hedge funds and other wealth management companies started to ", "see it as a store of value", " and protection from the decreasing purchasing power of the fiat currencies.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "February 8, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Market News", "title": "How Blockchain is Affecting The Future of Advertising", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "The digital advertising industry is projected to hit $427.26 billion in 2022", "\n", "Blockchain is set to change the advertisement industry with its decentralized system to usher in an era of transparency and reliability", "\n", "Firms like IBM, Microsoft, and Oracle have made the giant leap to Blockchain advertisement", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Blockchain: New On The Block, Yet So Powerful", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Blockchain, a relatively new piece of technology is rapidly changing the world as we know it and the advertising industry is not being left out. Statistically, the global blockchain market is projected to hit $23 billion in 2023 and a huge chunk of this estimate comes from blockchain’s foray into the advertisement industry.", "\n", "Similarly, due to the affinity of blockchain technology, the digital advertisement sector is projected to hit a whopping $427.26 billion in 2022.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Here’s How Blockchain is Changing The Game One Step At A Time", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Blockchain technology gained an entrance in the advertising space as a solution for data inflation and fake news circulating the internet.", "\n", "It comes on the scene as an alternative to popular platforms such as Facebook and Google ads which have already garnered a negative reputation for manipulating data for their gain. Here’s how Blockchain is revolutionizing the future of an advertisement, one step at a time.", "\n", "Blockchain allows the buying and selling of ads without a third party platform. These third-party platforms are notorious for wielding power and monopoly over data and blockchain stifles this monopoly by providing a decentralized system.", "\n", "Furthermore, using blockchain the right audience can be reached through automation. Reaching the right audience will generate genuine leads and subscriptions.", "\n", "With Blockchain technology in advertisement, advertisers can exercise greater control to limit the frequency of ads that a person can see, greatly reducing ad fatigue. Also, if the privacy of data is of utmost priority to you, you should consider Blockchain technology as an alternative to traditional methods.", "\n", "With Blockchain technology, permission is required before you can use the personal data of customers. With Blockchain dispensing with the need for third parties to verify ads, a lot of valuable time can be saved by advertisers.", "\n", "Without third parties, the cost of digital advertising becomes cheaper and can be easily affordable by advertisers unlike in the traditional methods where “middlemen” charge a premium to reach customers. Finally, Blockchain technology promotes reliability and transparency surrounding the origins of a product or the veracity of the news.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On The Flip Side", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "Kris Henley, communications manager with the Centre for the Digital Economy at the University of Surrey warned that blockchain technology is too complex to go mainstream.", "\n", "Blockchain has a lot to prove in its performance,” says Peter Hiom, deputy CEO at the ASX trading exchange, citing its peer to peer nature as a reason for transactional delays", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Companies at the Forefront of This Revolution", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Several companies have already made the transition to blockchain-enabled advertisements like ", "IBM Corporation", ", Amazon Web Services, ", "Microsoft Corporation", ", Oracle Corporation, McDonald’s, Nestle, and Virgin Media to increase transparency and trust amongst users.", "\n", "RadPay, a startup dedicated to pushing blockchain mainstream is at the forefront with its wide application in marketing applications. Similarly, Singapore based startups like Aqilliz and Affle are working round the clock to achieve a seamless switch to blockchain-based advertisements.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "February 15, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Market News", "title": "Lympo into Blockchain", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "Popular sports and health-based blockchain project, Lympo has announced the launch of its Vol. 2", "\n", "The project will be upgrading its Ethereum ecosystem and will feature an ERC-20 utility token, LMT", "\n", "The previous Lympo token, Lymus or LYM, will be able to swap their holdings for LMT tokens with a 1:1 ratio", "\n", "Per the announcement, Lympo will be venturing into the gaming industry, targeting the growing", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Lympo, a project with the goal of monetizing sports and health data via blockchain has announced the launch of a new blockchain.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "What is Lympo?", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Lympo is a blockchain project that focuses on establishing a global user-empowered ecosystem that enables and rewards fair and square exchange of user-generated sports, health, and wellness data. The Lympo ecosystem is made up of;", "\n", "\n", "Data owners who generate data by using mHealth devices and apps for health benefits.", "\n", "Gyms, trainers, insurers, physicians, sports inventory creators who use the created data to improve current equipment, workouts, regimens, plans, and health of their clients.", "\n", "Data proxies and processing businesses. Lympo API will empower third-party companies to develop data-driven healthcare solutions.", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Lympo and the Gaming Industry", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Lympo which previously focused on monetizing sports and healthy living will be delving into the gaming industry – an industry that generated a $152.1 billion global revenue in 2019.", "\n", "The target will be Gen Z, 43 percent of which play online games daily. During the pandemic, video game traffic increased by a hefty 75 percent and is poised to grow. The target will be to reach their audience with blockchain technology.", "\n", "While 2020 was tagged the year ", "Bitcoin went institutional", ", it was also a year ", "of immense growth for non-fungible tokens (NFT)", ". There was a 30 percent increase in crypto players and a significant boom in the ", "NFT ecosystem", ".", "\n", "Lympo has announced a partnership with Animoca Brands as it bids to claim its stake in the NFT ecosystem. The project also made new changes, including its token.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the Flipside", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "Mirror Trading international has been named the biggest crypto scam of 2020", "\n", "The project, according to Chainalysis, raked in a total of $589 million from more than 471,000 deposits", "\n", "Forsage and J-enco ranked below MTI, both defrauding investors of less than $350 million each", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The New Lympo Tokens (LMT)", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "At its launch in 2016, the project issued the Lympo tokens (LYM). However, moving on, the project has announced a new ERC-20 utility token designed to be the new native tokens for the Lympo ecosystem.", "\n", "The new LMT tokens will be the currency of purchase, utility, and attribution of sports-themed digital collectibles (non-fungible tokens, NFTs) in and outside of various games. The total supply of LMT has been fixed at 1,250,000,000 tokens.", "\n", "Like the old LMY tokens, LMT will consist of smart contracts. However, the token is designed to be more reliable and robust than the previous version.", "\n", "It will also feature cheaper transaction fees and multi-signature wallet functionality, which will enable secure communication between the Lympo app and the public blockchain.", "\n", "The project confirmed that the upgraded LYM token will be traded on the same exchanges (Gate.io, Huobi Global, Bitfinex, Ethfinex, KuCoin.) as the current tokens, as well as, with all the familiar LYM pairs.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Final Thoughts", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Not much was said about the nature of the partnership between Lympo and Animoca Brands. The project ", "announced", " that, in the coming weeks, it will release a lightpaper detailing how it will evade the gaming industry and the future of Lympo.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "February 15, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Bitcoin News", "title": "Fidelity is Optimistic About Bitcoin Regulation Under Biden Administration As The Crypto Market Transforms", "text": ["\n\t\t\t", "\n", "Biden’s administration is expected to bring positive crypto regulations, Tom Jessop", "\n", "President Joe Biden’s pick for chairman of the SEC represents a constructive attitude towards the industry", "\n", "There is still strong demand for Bitcoin from institutional investors", "\n", "\n\n\t\t", "\n\t\t\t", "Tom Jessop, the president of Fidelity Digital Assets has expressed his predominantly positive views on the future of Bitcoin and cryptocurrency regulation under President Biden’s administration. Jessop also confirms the increasing demand for Bitcoin from institutional buyers.", "\n\n\t\t", "\n\t\t\t", "Favorable Crypto Regulations Under President Biden", "\n\n\t\t", "\n\t\t\t", "In a recent interview, Tom Jessop expressed his optimistic views that the new administration will support the growth of the crypto industry. He starts by sharing his opinion about the president’s pick to head the ", "U.S. Securities and Exchange Commission (SEC), Gary Gensler", ".", "\n", "He explains that the move represents a constructive approach towards the regulation of the crypto industry. Given the experience of Gary Gensler, Jessop, who heads the Corporate Business Development for Fidelity Investments and president of Fidelity Digital Assets, believes that the administration will implement positive crypto laws.", "\n", "Jessop opined that the previous administration had begun to lay the groundwork for a constructive regulation of the crypto industry. He explains that the Comptroller of the Currency (OCC), under Brian Brooks, had implemented some ", "positive regulations for the industry", ".", "\n", "In early January, the regulator had announced that national banks and federal saving associations were now allowed to directly connect with blockchains and use stablecoins. This granted stablecoins a level of acceptance similar to debit cards and cheques.", "\n", "In commenting on the new Treasury Secretary, ", "Janet Yellen’s remarks", " that cryptos were popular for being used for illicit transactions, Jessop pointed to a recent report that proved that crypto-related crimes fell to only 0.34% of all crypto transactions in 2020.", "\n\n\t\t", "\n\t\t\t", "On the Flipside", "\n\n\t\t", "\n\t\t\t", "\n", "Iran has issued a ban on the use of Signal, the privacy-centered messaging app", "\n", "The move comes just after it was rumored that ", "Signal was working", " on integrating a cryptocurrency into its platform", "\n", "Starting from January 25, Iranians have been reporting issues in connecting to Signal", "\n", "\n\n\t\t", "\n\t\t\t", "Strong Demand for Bitcoin From Institutional Investors", "\n\n\t\t", "\n\t\t\t", "Once again, the crypto market is in a turbulent season, and there fears that Bitcoin, the leading crypto, would lose its appeal to investors due to its volatility.", "\n", "In speaking on the drastic price movements, the president of Fidelity Asset notes that;", "\n\n\t\t", "\n\t\t\t\n\t\t", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "February 2, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Bitcoin News", "title": "What Does the Crypto Bill Mean for India Investors?", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "Less than a year after Cryptos became legal in India, a new bill could reverse the rights", "\n", "A new bill passed to the parliament seeks to prohibit the use is all “private Cryptocurrencies” in India", "\n", "Part of the bill confirms that India is making plans to launch a central bank digital currency (CBDC)", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Regulation of the crypto industry in India has been a long-standing problem. In 2107, the Reserve Bank of India (RBI) placed a blanket ban on the use of Cryptos within the country. ", "The ban was eventually lifted in 2020 giving investors the hope of better things to come", ".", "\n", "Less than a year after Cryptos was declared a legal asset in India by the Supreme Court, another new bill has been listed for introduction in Parliament that seeks to ban all private cryptocurrencies in India.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Details of the New Bill", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "In 2019, there was a draft bill “Banning of Cryptocurrency and regulation of official digital currency” passed to the Parliament. Although the bill was never passed, there is another, looking to reach the same goal.", "\n", "The current bill is split into two sections. The first states that there would be a regulatory framework put in place to help the reserve Bank of India (RBI) launch its Central Bank Digital Currency – making India the latest in the growing list of countries pursuing a CBDC.", "\n", "The second section seeks to ban the use of Cryptocurrencies within India, with some exceptions. If the bill “Cryptocurrency and Regulation of Official Digital Currency ” is passed “private Cryptocurrencies” will become illegal to hold and trade within India.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the Flipside", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "The Philippines central bank has expanded the country’s cryptocurrency regulation after seeing “accelerated growth” in the use of crypto exchanges", "\n", "The new regulatory framework is in line with the guidelines recommended by the Financial Action Task Force (FATF)", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "What Does the New Bill Mean?", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "In 2019, Arun Jaitley, then finance minister, had stated the government’s resolve to discontinue the use of bitcoin and other virtual currencies. This new bill looks more like a continuation of the previous statements made by government officials.", "\n", "India is currently home to over 7 million people", " who own over $1 billion worth of digital assets in India. CEO of Zebpay, Rahul Pagidiapti has explained that Cryptocurrencies should not be banned simply because the RBI is planning on launching a CBDC.", "\n", "In a statement he explained;", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Bitcoin and most crypto assets are more like gold and not an alternative to government-issued legal tender. Crypto assets and digital government currency can coexist and together, they can bring tremendous benefits to the Indian economy.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "The bill seeks to prohibit the use of Private Cryptocurrencies. By literal definition, Bitcoin and a host of other Cryptocurrencies are public Cryptocurrencies. In addition to running on a public blockchain, no single individual can claim complete ownership of any crypto.", "\n", "Until the parliament clarifies what it means by “private Cryptocurrencies,” the public remains uncertain as to how the industry will be affected.", "\n", "If the bill does prohibit the use of public Cryptocurrencies like Bitcoin and Ethereum in favor of the CBDC, then it would be a direct move against decentralization. These cryptos are representative of a decentralized economy, one that is being harnessed in different parts of the world.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "February 3, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Bitcoin News", "title": "Bitcoin is Inherently Risky and Vulnerable to 51% Attack – General Manager of BIS", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "The general manager of the Bank for International Settlements (BIS) has criticized Bitcoin for being too risky", "\n", "Agustin Carstens says the leading cryptocurrency is inherently risky and “increasingly vulnerable” to a 51% attack", "\n", "He believes that Bitcoin would breakdown altogether", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "General manager of the Bank for International Settlements (BIS), Agustin Carstens, has criticized the biggest cryptocurrency for being inherently risky and “increasingly vulnerable” to a 51% attack.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Bitcoin is Becoming More Vulnerable", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "In a ", "speech delivered", " at Hoover Institute on January 27, 2021, Carstens, the head of BIS opined that as Bitcoin approaches its maximum supply of 21 million coins, the network will become more vulnerable to majority attacks against the network.", "\n", "He asserted that as fewer coins being produced in block rewards, the processing time for transactions will also decline, as a result, the vulnerability of the network against attacks will go up.", "\n", "Carstens who is a long-time bitcoin skeptic further stated that investors must be cognizant that bitcoin may well break down altogether. In his opinion, only central banks should be issuing digital currencies.", "\n", "The immense power required for mining Bitcoin is another point he notes. The sustainability of long term crypto mining doesn’t exist currently. And as he puts it the alleged price manipulation is the reason for this impending breakdown.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the Flipside", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "Billionaire businessman and inventor, Elon Musk, has once again raised speculations that he is or would be holding bitcoins", "\n", "The founder of Tesla and SpaceX on Friday updated his profile to #Bitcoin, while cryptically tweeting “it was inevitable” shortly afterward", "\n", "The tweet sent social media users into a frenzy with the price of Bitcoin responding by spiking by 17 percent in the next 24 hours", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Bitcoin, Private Coins are Unrealistic", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "One issue that has lingered around Bitcoin and the entire crypto market has been the high volatility of the asset class. On this issue, Carstens noted that;", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Bitcoin poses as its own unit of account, but fluctuations in value mean it is unrealistic to set prices in bitcoin. This also undermines its usefulness as a means of exchange, and makes it a poor store of value.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "He explained the scarcity and cryptographic technology used by Bitcoin is not enough to suffice as a guaranteed store of value. Hence, the imminent doom of the cryptocurrency. Another unrealistic asset class, according to Carstens, are private coins.", "\n", "Carsten opines that private stablecoins cannot serve as the basis for a sound monetary system. Private coins have been heavily criticized for the anonymity and potential use in money laundering and illegal transactions. If they are to be used, Carsten notes that private coins need to be heavily regulated and supervised.", "\n", "He closes by explaining that if digital assets are to gain mainstream acceptance and use, then central banks would be integral to their success. The role of central banks in the industry would ensure the stability of value and oversee the overall security of the crypto industry.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "February 1, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Ripple News", "title": "Grayscale Dissolving Its XRP Trust", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "The SEC sued Ripple Labs for selling XRP coins as security.", "\n", "Various cryptocurrency exchanges delisted XRP from their platforms.", "\n", "The world’s largest digital currency asset manager terminates its XRP Trust following the SEC lawsuit.", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "The world’s largest digital currency asset manager Grayscale Investments announced the start of its Grayscale XRP Trust dissolution process.", "\n", "As the ", "official statement", " released on January 13 says the move comes after the Securities and Exchange Commission (SEC) filed a lawsuit against Ripple Labs last month arguing digital asset XRP to be a security under the United States law.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "SEC lawsuit", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The SEC filed a lawsuit against Ripple Labs, the company behind XRP, and against its executives Brad Garlinghouse and Chris Larsen for misleading XRP investors.", "\n", "The company ran years-long coin offerings and sold $1.3 billion worth of XRP without registering with the regulators.", "\n", "The SEC considers an XRP cryptocurrency as a security, meaning it is a tradable investment contract used to raise funds for a business or organizations. The regulator accused the Ripple Labs of sharing only partial information with the investors.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the flip side", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "Ripple Labs rejected the charges, stating that XRP is a currency and does not need to be registered. ", "In the long-term cancellations or differentiation between ICOs and tokens based on analog governance models are possible.", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Domino effect", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The lawsuit, filed in New York federal court on December 22, 2020, sent XRP price down in minutes. The coin which traded at ", "$0.59", " at that time lost half of its value in days.", "\n", "The major cryptocurrency exchanges including Coinbase, Crypto.com, Bitstamp and Binance suspended XRP trading and delisted it from their platforms.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Grayscale’s moves", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Following the SEC actions Grayscale removed XRP positions from its Digital Large Cap (DLC) Fund earlier this year. On January 5, 2021 the digital asset manager announced the XRP removal from the DLC Fund, which includes Bitcoin, Ethereum, and Litecoin.", "\n", "The liquidation of its XRP Trust comes as a logical measure in response to the SEC lawsuit. As stated in an official press release, “it is likely to be increasingly difficult for U.S. investors, including the Trust, to convert XRP into U.S. dollars, and therefore continue the Trust’s operations.”", "\n", "Grayscale will distribute the proceeds to its XRP Trust shareholders after excluding its fees and expenses.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "January 14, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Altcoin News", "title": "Dapper Labs, a Blockchain Startup Selling NBA Collectibles Hit $50 Million Sales in 30 Days", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "Dapper Labs raked more than 50 million in sales in just under 30 Days", "\n", "Similar to trading cards, the digital method, verifiable trading history, and the fact that they are sold in limited edition packs make NBA Top Shot a valuable investment", "\n", "Each NBA Top Shot Video Card is secured by a Blockchain called Flow", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Blockchain Start-up, Dapper labs caught the attention of tech aficionados and the sports community when it entered into a joint-venture partnership with the National Basketball League in 2020 to allow fans to buy collectible video moments from games.", "\n", "The non-fungible token (NTF) market is witnessing a large increase in volume, becoming more popular in 2020. In the third week of January, ", "the NTF market completed over $4.6 million in sales", ".", "\n", "The health-based project, Lympo ", "has also announced its plans to upgrade its blockchain to enter into the gaming and NFT market", ". Another highlight of the growth of the NFT market.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Dapper Labs Hit $50 Million in 30 Days", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "One year later, it seems this gamble has paid off with over $50 million in sales coming from its NBA Top Shot Platform. The digital packs on the NBA Top Shot retail for between $9 and $230 depending on the scarcity or the star power of the player on the pack.", "\n", "While most of the transactions fall in between this bracket, some iconic moments have sold for prices in the region of almost $100,000 with Lebron James’ iconic tribute dunk being purchased for a whopping $71,455. The sheer amount of volume traded on the platform in a short amount of time is a testament to the wide acceptability of blockchain technology.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "NBA Top Shot Platform: The Future of Sports Collectibles.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "At its heart, the NBA Top Shot is like trading sports cards. However, what makes the NBA Top Shot unique is its digitization, and that sets it miles apart from traditional cards. It takes video highlights of iconic NBA moments and turns them into limited edition digital collectibles.", "\n", "Their digital nature makes trading instantaneous compared to regular trading cards. The videos are more immersive than static photos and the authenticity of the transactional records can be easily verified making it a highly secured investment for sports collectors.", "\n", "The need for postal mail and paying for a rating agency is circumvented using the NBA Top Shot Platform. Users simply have to buy their preferred digital cards, store them in a digital wallet and either sell or trade them for profit in the future.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the Flipside", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "Arguments against blockchain have filled public discourse about the complex nature of this piece of technology and its application by regular people.", "\n", "Veterans in trading game cards may find the switch to digital cards a bit strange and may decide to continue using traditional trading cards which already have a massive following.", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The Technology Behind The Innovation", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "A couple of years ago, Dapper Labs experimented with Cryptokitties, a game that allowed users to buy and sell virtual cats. The lessons from that venture transformed to the perfection of Flow Blockchain which has a real-world application. Flow Blockchain allows Dapper Labs to track in real-time the trade history and authenticity of digital cards.", "\n", "The decentralized nature of Flow Blockchain gives room for developers to program software that will ultimately make the platform stronger. CEO of Dapper Labs Gharegozlom said, “Blockchains are public computers.", "\n", "They are infrastructure that you pay to use in the form of a token rather than paying dollars to Amazon or Google to run your operations. That’s what’s happening behind-the-scenes:", "\n", "A user is coming with a credit card, you can come with bitcoin, you can come with any currency you want to come with, but every transaction is being powered by the Flow blockchain, every asset is being authenticated and secured by the Flow blockchain.", "\n", "Recently, Justin Roiland, the co-creator of the Adult Swim cartoon series Rick and Morty, sold an art collection on the NFT auction house Nifty Gateway, ", "for over $1 million in Ethereum.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "February 15, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Ripple News", "title": "XRP Inflation Rate Highest Among the Leading Cryptos", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "The XRP lost its position as the third biggest cryptocurrency by market capitalization. Furthermore, the inflation rate of the coin has increased within the financial year.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "According to the latest data by crypto analytics Messari, the XRP inflation rate ", "grew", " by up to 20%. The current XRP inflation of a circulating supply is five times bigger compared to the world’s dominant cryptocurrency Bitcoin.", "\n", "As Messari’s researcher Florent Moulin ", "shared", " in his Twitter message, the inflation of XRP is the highest among the leading cryptocurrency assets. It is five times higher compared to Bitcoin’s circulating supply inflation rate before the third ", "halving", ".", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "XRP circ supply inflation rate (20%) is the highest among large-cap assets over the past year, 5 times higher than BTC pre-halving.", "Only 30% of XRP max supply has been distributed, vs 87.5% for BTC", "BTC is up 20% since last year, XRP is down 47%.", "https://t.co/NRtXm0QpGE", "— Florent Moulin (@fmoulin7) ", "May 21, 2020", " ", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Furthermore, the analytic stated that only 30% of XRP maximum supply has been distributed yet. Meanwhile, compared to 87.5% of Bitcoin’s at the same time.", "\n", "The inflation rate in circulating supply is a factor that can have a crucial influence on the price of a cryptocurrency. When the undistributed coins are moved into circulating supply, they become available to be bought on the market. This usually lowers the price of the asset, as demand does not necessarily match with the increased volume of coins being sold.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Ripple, the company behind XRP cryptocurrency, together with its founders controls about 75% of all XRP tokens. The company has been making constant sales of coins within the last year. As stated by Kyle Samani, a co-founder of crypto hedge fund Multicoin Capital, in his ", "interview", " with Bloomberg, Ripple has become more aggressive in their selling. According to him:", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The company has been steadily increasing their sales of XRP over the previous three quarters, likely inflicting downward price pressure on XRP.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "The sell-offs might be largely related to the uncertainty with the regulatory institutions due to the ongoing investigation of XRP token sales as the unregistered securities. If the company is found to have violated the law, the XRP trade might be restricted or even stopped.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The company however has been ", "thriving", " in making new global partnerships and gaining ", "institutional interest", ". Ripple has made big steps into the cross-border payments market. Partnerships with the National Bank of Egypt and leading US-Mexico remittance service providers settled the company as one of the prominent players in the cross-border payments industry. Furthermore, the company’s global payments network grew to more than 300 customers worldwide last year, with payout capabilities in over 70 countries.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "May 30, 2020", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Ethereum news", "title": "Stock Exchange Crypto Trading Volume Soars in Switzerland, Creates a New Record High of $1.2 Billion", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "Swiss stock exchange’s crypto trading volume hits a record high of $1.2 billion", "\n", "The Swiss stock exchange enjoyed its best year in 2020, as it recorded its highest-ever transactions in 12 months", "\n", "The Swiss exchange now offers 34 exchange-traded products", "\n", "Investors have access to over 100 different crypto products trading", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "SIX Swiss Exchange, Switzerland’s principal stock exchange has revealed that the country has witnessed a rise in crypto trading volume as it sets a new record high of CHF 1.1 billion ($1.23 billion) in 2020.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Switzerland’s Crypto Trading Volume on Stock Exchange Soars", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Christian Reuss, Head of Markets at SIX Swiss Exchange on Wednesday announced that Switzerland has recorded its largest-ever crypto trading volume in a single year.", "\n", "The announcement states that a total of CHF 1.1 billion or USD 1.3 billion was traded in 2020. This is the first time the regulated market would be exceeding an annual trading volume of over 1 billion.", "\n", "And it represents a 112 percent increase in the trading volume from 217 when it recorded CHF 525 million.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The Swiss Crypto Market is Growing", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Not only did the Swiss Stock Exchange record a new high in its annual trading volume, but the reports also showed that the market is growing.", "\n", "It was reported that the number of trades also reached a new record of 48,024. This means that the market is growing not only in volume but also in size.", "\n", "SIX Swiss Exchange announced that it now offers 34 exchange-traded products, allowing investors access to 100 different digital assets.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the flipside", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "As Switzerland records a new milestone achievement in its crypto stock exchange, the United Kingdom has finalized the ban on crypto derivatives within its borders.", "\n", "The ban forbids the sale, marketing, and distribution of CFDs, options, futures, and ETNs that reference cryptocurrencies to retail investors", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "In July 2020, Swiss cryptocurrency investment management boutique FiCAS launched the world’s first actively managed bitcoin exchange-traded product (ETP) on the Swiss platform.", "\n", "The ETP, ", "Bitcoin Capital Active ETP", " is currently listed on the SIX Swiss Exchange with a management fee of 2 percent. BTCA trades BTC against the top 15 Altcoins and also can move to fiat.", "\n", "Since then, the number of ETPs on the Swiss platform has only grown.", "\n", "Along with the Wednesday announcement, Six Swiss Exchange revealed that a new bitcoin ETP from ETC Group has been listed on the regulated stock exchange.", "\n", "The BTCetc bitcoin ETP (BTCE) is used for tracking the price of bitcoin and is physically backed, meaning ETC Group actually holds the underlying cryptocurrency.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "January 18, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Ripple News", "title": "XRP Sales Increased, Price up 70% In a Month", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "XRP regained the position of the third biggest cryptocurrency by market capitalization as the coin surged significantly within the second quarter.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Ripple, the company behind its native XRP cryptocurrency, sold more than $32.55 million worth of tokens during the second quarter of the year. The number marks the impressive growth of nearly 19 times compared with the $1.75 million results recorded during the first quarter of 2020.", "\n", "As the company reveals in its yesterday released ", "Q2 2020 XRP Markets Report", ", the value was mainly generated by over-the-counter (OTC) sales. Ripple shifted its focus to OTC sales in order to increase liquidity, which is vital to evolving and expanding RippleNet’s On-Demand Liquidity (ODL) and also its customers.", "\n", "ODL network is Ripple’s solution to facilitate cross-border payments by using blockchain and XRP coins in order to improve transaction speed, transparency, and lower the costs. According to the latest report, the ODL transaction volume increased by 11 times year-over-year and accounted for nearly 20% of the total RippleNet’s volume during the second quarter. The company claims, the main reason for the growth is institutional interest:", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "As more financial institutions leverage RippleNet’s ODL service, more liquidity is added into the XRP market. [...] More than ever, financial institutions are seeing the value of RippleNet’s ODL service to provide instant, global payments and meet market demand, especially during times of crisis due to the exposed risk and increased volatility.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "The rapid price surge", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The XRP price continued to rise during the second quarter increased by over 20% since the mid-March dump when the entire cryptocurrency market crashed due to the global pandemic. The coin though continued to grow intensely since the first days of July, resulting in nearly 74% growth during the past 30 days.", "\n", "Ripple, which ", "ranks", " the third biggest cryptocurrency by CoinMarketCap, didn’t slow down and even made the giant leap up by nearly 40% during the last 7 days, reaching the level of $0.31 on August 3. The highs were briefly seen in the middle of February.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Although there is no clear explanation of the recent price growth, it might be addressed to the increased number of big investors, the so-called whales. According to the crypto data aggregator ", "Santiment", ", nearly 60 new investors holding from 1 million to 10 million XRP coins entered the market on July 23.", "\n", "Moreover, the number of investors holding up to 1 million coins is gradually increasing since the end of June, resulting in more than 450 whale accounts opened within a month.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "The institutional interest in digital currencies increased significantly this year. The number especially grew since the pandemic, as big investors turned to cryptocurrencies as the hedge against the inflation and the ", "weakening dollar", ".", "\n", "Meanwhile Ripple expanded the list of institutional clients and strengthened its positions in the cross-border payment market throughout the year by entering into strategic partnerships with national banks and companies like American Express, MoneyGram, Santander and SBI Remit.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "August 4, 2020", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Ripple News", "title": "Ripple Price Prediction: How Much XRP Will Be Worth in 2021?", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "XRP is considered as the bridge currency, that helps to move funds faster and cheaper.", "\n", "Ripple attracted a lot of institutional investors lately.", "\n", "Fundamental factors and technical analysis predict XRP price growth in the long-term.", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Various companies fell during the crypto winter and back in 2019. Meanwhile, Ripple, the company behind the world’s third cryptocurrency XRP, accelerated and showed its strongest growth in the year to date.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "The XRP price prediction article will review both historic price movements of XRP as well as the current situation and future prognosis. The company that gained a lot of attention from global institutional investors is expected to enter into one of the most important moments in its existence. Since the altcoin market has positive correlations with the Bitcoin, the fact of the Bitcoin halving might also work as a catalyst for the future price of XRP.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "What is Ripple?", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "First and foremost it is important to know that Ripple and XRP are not the same. Although lots of crypto users tend to merge them and talk about Ripple as cryptocurrency, this is not entirely true.", "\n", "Ripple is a California-based technology company that creates and develops the Ripple payment protocol. That protocol allows banks, payment providers, cryptocurrency exchanges, or businesses to transfer money worldwide using blockchain technology.", "\n", "2004 can be considered as the debut date of Ripple, as Canadian web and decentralized systems developer Ryan Fugger created the first prototype of Ripple Pay. The financial technology company of the time aimed to create a decentralized peer-to-peer payment network.", "\n", "However, the official founding date usually is 2012, when Chris Larsen and Jed McCaleb acquired the company and renamed it to Opencoin. The company since concentrated on developing the Ripple protocol, seeking to enable the near-instant, direct transfer of payments between two parties in any currency. The protocol aimed to improve the speed of transactions and reduce delays within traditional payment systems. A few years later the company returned to its original name Ripple.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Ripple relies on a common shared XRP Ledger. The distributed consensus ledger, or distributed database storing information about all Ripple accounts, is used since 2013 to support financial institutions like crypto exchanges for fast cross-border payment. It is known that XRP Ledger can handle 1.500 transactions per second. XRP currency is the native asset of the XRP Ledger.", "\n", "The company recently became an object of interest to solid institutional investors. Partnerships with leading US-Mexico remittance service providers and the National Bank of Egypt allows Ripple to become one of the prominent players in the cross-border payment industry. Furthermore, the major cryptocurrency custodian ", "Anchorage", ", the member of ", "Facebook Libra", " and ", "Celo", " alliances, added XRP as an asset for its corporate investors.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "What is XRP?", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "XRP", " is a digital asset, or in other words a cryptocurrency, that lives on a public ledger and can be transferred using digitally signed transactions. The XRP aims to increase the speed and reduce the cost of transferring funds across various companies and borders. It is also used as transitional currency for institutions that exchange value between multiple fiat currencies.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Although a native token of XRP Ledger, the XRP is an independent asset and may exist without Ripple. The only control it has over it is the one by the users of XRP or XRP Ledger. Currently, there is a maximum supply of 100 billion XRP.", "\n", "The asset is ranked fourth by market capitalization, at the time of publishing. According to ", "CoinMarketCap", ", XRP market capitalization is $8.9 billion and the circulating supply floats around 44.1 billion at the time of publishing.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "What is XRP used for?", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The main benefits that XRP provides for its users are low fees and fast cross-border transactions. Since there are lots of currencies that cannot be directly exchanged, the XRP is used as a bridge (or intermediary currency) much cheaper than the standard fiat currencies like the US dollar.", "\n", "Furthermore, the coin ensures fast international transactions. Since the average XRP transaction takes 4 seconds, there can be around 1.500 XRP transactions every second. The rate is way faster ", "compared", " to 8 transactions per second on the Bitcoin blockchain.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "For a long time, the XRP coin was considered as the bridge currency, the one that helps to move funds faster and cheaper. However, the coin can be an asset to the investment itself. And since Ripple attracted a lot of institutional investors lately, the XRP price prediction might largely depend on the fundamentals surrounding the ecosystem of Ripple.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Historic moves of XRP price", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "For those who want to invest in XRP, it would be useful to have a broader view of how the XRP price acted since its start in 2012. The coin’s price floated around $0.005 for nearly 5 years when 2017 brought the incredible “to the moon” heights.", "\n", "Together with the whole crypto industry, the XRP price increased nearly seven times and skyrocketed to $0.36 within the May 2017.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "The price then settled down at around $0.20 per coin and remained at the same level until the next massive peak. At the beginning of December 2017, the XRP started the impressive skyrocketing when it shot from $0.24 to the all-time-high of $3.84 in the first days of January 2018.", "\n", "Since then the third-ranked crypto asset by market capitalization started to fall gradually. Within four months, XRP dropped nearly 8 times in its value reaching the price of $0.49 in April 2018.", "\n", "After the short rebounce of $0.81, the XRP price stabilized at around $0.30 since September, when it once again climbed more significantly to $0.57. However, since then there were no breakthroughs and the XRP price remained at a more steady price range between $0.20 and $0.50.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "XRP price forecast for 2021 and 2025", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "There are several factors like ", "Bitcoin halving", ", ", "institutional interest", ", and the ", "rise of Central Bank Digital Coins", " (CBDC), that can affect XRP price differently. Let’s have a look at them before jumping to XRP long term forecast.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The factor of Bitcoin halving", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Since Bitcoin acts like the leading North start for lots of altcoins, XRP is not an exception. The whole cryptocurrency ecosystem is largely affected by the price moves of Bitcoin.", "\n", "The Bitcoin halving process is the key event not only for the leading crypto asset but for the whole industry as well. The event that takes place every 4 years and cuts Bitcoin miners’ reward in half, usually brings the spurt of price growth in a long-term perspective. And since the correlation between Bitcoin and altcoins remain positive, the positive price forecasts for Bitcoin might as well result in positive XRP price prediction 2021.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The factor of institutional interest", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Furthermore, Ripple has made a lot of important ", "collaborations", " throughout the previous years. The partnerships with national banks and companies like American Express, MoneyGram, Santander and SBI Remit services fueled the institutional trust in XRP. The company’s global payments network grew to more than 300 customers worldwide last year, with payout capabilities in over 70 countries.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "This means that if XRP gets adopted on a massive scale, the token will have the objective of a significant price increase. Crypto exchange aggregator ", "CoinSwitch", " predicts, that the factor “can undoubtedly make Ripple stand out in a crowd of digital currencies.” Furthermore, the company predicts that:", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "As per the XRP price trends, the experts believe that it will enter into countless partnerships with financial institutions. By 2021, XRP might touch the $2 mark.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "The factor of stablecoins and CBDC", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the other hand, there are other opinions concerning the XRP price prediction. The growing role of ", "stablecoins", " and the development of central bank digital currencies (CBDC) is a major threat that might decrease the XRP adoption rate across institutional usage.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Since various financial giants like ", "JPMorgan", " (and ", "Visa", " recently) are turning to the development of blockchain-based digital currencies to enable payment transactions, XRP might become affected by the bigger competition that might definitely affect its price.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "XRP price prediction for 2021", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "As popular cryptocurrency exchange aggregator ", "DigitalCoinPrice", " predicts, XRP should grow up to $0.75 by April 2021 and even reach $0.87 at the beginning of 2022. The website uses statistical methods based on the historical Ripple price data that cover correlations, trading growth, and even the frequency of significant events over time.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "This is a positive XRP pierce prediction though, while the more cautious forecasts expect the price to remain volatile and even fall to the lows of $0.51 in September 2021.", "\n", "In parallel, another XRP price aggregator ", "LongForecast", " provides with more reserved XRP price forecasts. The website predicts, XRP price should fluctuate between the bottom price of $0.22 and the highs of $0.34, that XRP might reach in March 2021.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Meanwhile, cryptocurrency trader ", "VincePrince", " brings his insights claiming that XRP will go through a second bull-market confirmation in the beginning of 2021. Following his predictions, XRP should rally and test its all-time high of $3.7 at some point during the year.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "XRP price prediction for 2025", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "With more upcoming institutional partnerships and forming bullish trendlines, the five-year term perspectives look quite bright for XRP. This means XRP price prediction 2025 might look positive.", "\n", "According to crypto exchange ", "Changelly", ", the average price of XRP in 2025 will be around $2.32. The ", "Cryptoground", " analysis, based on the historical XRP price chart, supports the prediction and forecasts nearly 850% price growth up to $1.94 in 5 years.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Meanwhile, ", "DigitalCoinPrice", " XRP price prediction 2025 expects the asset’s price to climb over the $1 mark and remain there for the whole year. According to the prediction chart, the website expects fluctuations among the highest price of $1.23 in January and the lowest $1.02 in July 2021.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Is XRP a good investment?", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "There are lots of important factors across the world’s Top 5 cryptocurrency XRP, that might significantly affect the future direction of its price movement. Ripple, the company behind XRP successfully expanded the list of institutional clients and strengthened its positions in the cross-border payment market.", "\n", "Bitcoin halving and growth can also bring bright perspectives for the potential rally of XRP as the whole altcoin market corresponds with Bitcoin price changes. On the other hand, XRP investors have to evaluate the increasing popularity of stablecoins and the factor of CBDC, that can create competition for XRP in the long-term perspective.", "\n", "Meanwhile, both key factors and historical price chart analysis indicate a positive trend, the XRP price prediction for 2021 and 2025 might be optimistic for the investors.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "October 14, 2020", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Ethereum news", "title": "Grayscale Reports Increase of Ethereum-Only Investors", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "The largest digital currency asset manager Grayscale Investments said institutional investors are interested in the world’s second-biggest digital coin.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "As Michael Sonnenshein, managing director at Grayscale Investments ", "told", " Bloomberg, Grayscale sees a growing new group of investors that are mostly or only interested in Ethereum (ETH).", "\n", "According to him, Ethereum which is the most actively used blockchain network becomes more and more accepted as an asset class.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Over the course of 2020 we are seeing a new group of investors who are Ethereum first and in some cases Ethereum only. There is a growing conviction around Ethereum as an asset class.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Ethereum (ETH) trades at $595 at the time of publishing and is up about 300% year-to-date (YTD), according to ", "CoinGecko", ". It’s price strongly increased in July during the DeFi (Decentralized Finance) boom when the whole dApp industry went wild.", "\n", "Decentralized finance projects are mostly built on Ethereum and were on fire this summer. The total value locked on Ethereum network was ", "breaking records", ".", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Grayscale Ethereum Trust", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Grayscale Ethereum Trust (ETHE) is the company’s second most popular cryptocurrency trust after the leading Bitcoin Trust, which has accumulated over $10 billion worth of BTC under its management until December 2020.", "\n", "According to Grayscale, the Trust which provides investment exposure to the Ethereum ", "processed", " $1,581.6 million worth of ETH and saw it’s one of the best performances this November as well.", "\n", "ETHE reached its all-time high trading volume within the past month, shows the statistics from YCharts. It’s 30-day average daily volume is over 281 million at the time of writing.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "11/30/20 UPDATE: Net Assets Under Management, Holdings per Share, and Market Price per Share for our Investment Products.", "Total AUM: $12.2 billion", "$BTC", " ", "$BCH", " ", "$ETH", " ", "$ETC", " ", "$ZEN", " ", "$LTC", " ", "$XLM", " ", "$XRP", " ", "$ZEC", " ", "pic.twitter.com/1FJTJIegYU", "— Grayscale (@Grayscale) ", "November 30, 2020", " ", "\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "ETHE reached its all-time high trading volume within the past month, shows the statistics from ", "YCharts", ". Its 30-day average daily volume is over 281 million at the time of writing.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Grayscale’s Ethereum Trust became a Securities and Exchange Commission (SEC) reporting company this October. The move is believed to increase ETHE’s transparency and liquidity. Meanwhile, it’s investors will be able to sell their assets after a 6-month lock-up, which previously lasted up to 12 months.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "December 7, 2020", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Ethereum news", "title": "Ethereum Corrects After Its Three-Year High Shot", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "Ethereum reached $1.163 after an intensive 80% per week growth rally.", "\n", "Exchange flows data indicates a tendency to hold ETH coins.", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Ethereum (ETH) broke through a $1,000 mark after the impressive bull rally this weekend. The world’s second-largest digital asset tested the highs of ", "$1,163", " early on Monday. The last time this high ETH was in January 2018.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Double-digit bull rally", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Ethereum rocketed up by nearly 50% on Sunday, January 3, climbing up by more than $380 on various trading platforms. The past week was one of the best for Ethereum as the coin spurted from the $634 mark on 27 December and increased more than 80% till today.", "\n", "During the last 12 months, the coin climbed over 600%, accounting for over $110 billion in market capitalization at the time of publishing.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "What’s behind the massive uptrend?", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Ethereum spurted moments after Bitcoin tested the new all-time highs of $34,605 and began to retract earlier on Sunday. Historically, Bitcoin’s bull run is supposed to inspire the altcoins rally, primarily led by Ethereum.", "\n", "This is a standard movement in cryptocurrency markets, Vijay Ayyar from Luno cryptocurrency exchange ", "told", " Bloomberg. According to him, this comes as a result of capital shift on other well-performing assets:", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "This rotation happens usually when Bitcoin has a large rally and investors rotate profits into other digital coins.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "At the same time, institutional interest in Ethereum is growing significantly. Grayscale Ethereum Trust ", "hit its milestone $2 billion mark", " of assets under management (AUM) before New Year’s Eve. The first publicly-quoted ETH investment product in the US doubled since the start of November, representing fast-growing institutional investments in Ethereum.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "We did it! $20 billion in AUM to end 2020, up from $2 billion a year ago", "Super proud of ", "@Sonnenshein", " and the rest of the ", "@Grayscale", " team", "Here's to another 10x in 2021! Happy new year everybody ", "https://t.co/KneF4BvPFO", "— Barry Silbert (@BarrySilbert) ", "December 31, 2020", " ", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The institutional investments on ETH are expected to grow, as the world’s leading derivatives marketplace Chicago Mercantile Exchange (CME) announced the launch of Ethereum futures contracts from February 8.", "\n", "Accordingly, as ", "Glassnode data analytics reports", ", Ethereum funding rates already are at record highs. These rates are part of futures contracts traded across various crypto exchanges", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the flip side", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "The hashrate of the Ethereum network ", "increased to the all-time high", " of 306.3 TH/s on January 3. ", "\n", "The average Ethereum transaction fee increased to the highs of $10.2 today, ", "YCharts reports", ".", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "What’s next for ETH price?", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "After reaching the three-year high, Ethereum dropped to nearly 20% on Binance today, approaching the support line of $920. It bounced back to over $1.020 in a few hours and trades at around $1,045 at the time of publishing. This is still 27% lower than its all-time high of $1,433.", "\n", "However, the ", "data of exchange flows ", "from CryptoQuant reveal the growing tendency to withdraw ETHs from the trading platforms, suggesting investors are here to hold instead of trading.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "January 4, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Altcoin News", "title": "Cardano (ADA) Overtakes Ripple (XRP) to Become Fourth Largest Crypto", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "Cardano has overtaken XRP on the list of Largest Cryptos by market cap", "\n", "A market cap of $21.4 billion makes Cardano the fourth largest cryptocurrency", "\n", "Cardano also reached a three year high of $0.719 in the process", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Cardano (ADA) Flips Ripple’s XRP", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "In what looks like an altseason, Cardano has flipped XRP and now holds the position of the 4th largest cryptocurrency by market cap. The last altseason, when investors targeted altcoins was in early 2018.", "\n", "Cardano which traded under $0.5 before the electric car manufacturers Tesla announced that it had acquired a Bitcoin holding of $1.5 billion quickly spiked, overtaking XRP in the process.", "\n", "ADA traded as high as $0.719 on Monday, February 8th which represents the highest price the coin has traded at in three years.", "\n", "Although Cardano now trades at $0.68 per coin, the boost was enough to earn it the 4th position on the list of Cryptos ranked by market cap. Cardano now holds a market cap of $21.2 billion while XRP holds $20.7 billion.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the Flipside", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "The Ethereum based project, ERC20 (ERC20) which describes itself as a payment method for the Belance blockchain platform is one of the biggest losers of February.", "\n", "Over the last 24 hours, ERC20 has stopped by 70 percent and now trades at 0.002041 per token.", "\n", "The utility token, CY Finance (CYF) tops the list with a price drop of 80 percent over the last 24 hours", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Ripple’s XRP Loses Top-5 Crypto Status", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "A usurping of XRP by Polkadot and Cardano leaves it trailing behind the top five cryptocurrencies by market cap. Ripple which once sat comfortably as a top 5 crypto now holds the 6th position.", "\n", "XRP briefly lost its top-three altcoin position on the 9th of February after newcomer and ", "Ethereum killer, Polkadot (DOT)", " overtook its market cap in an ongoing altcoin shake-up.", "\n", "New data now shows that the XRP is trailing behind both Polkadot and Cardano after the crypto market went into another frenzy. The bill run which began after electric car manufacturers, ", "Tesla announced that it had acquired a Bitcoin holding of $1.5 billion", ".", "\n", "Although the XRP has reclaimed its 5th position, the margins remain very tight, which means it could lose it very soon. While XRP has a market cap of $20.76 billion, Polkadot (DOT) currently has a market cap of $20.66 billion.", "\n", "With that, XRP in the top five cryptocurrencies by market cap could soon be a thing of the past. With contenders from fast-growing Polkadot (DOT) and Cardano (ADA) which has set its sights on a sidestep of its own.", "\n", "In the last 8 days, Cardano has skyrocketed by over 100 percent, making it one of the top-performing Cryptos of February. ADA pushing past the psychologically important $0.50 barrier amid high buying interest from investors means we could see more upward momentum in the coming days.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "February 10, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Ethereum news", "title": "A Case for Ethereum: 2021 – 2022", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "Ethereum outshines Bitcoin in recent market performance", "\n", "The Ethereum Dapp network is built for sustainable growth", "\n", "Dapps are already being used to solve real-world problems", "\n", "Ethereum has launched its Beacon Chain, plans an upgrade to Shard Chains", "\n", "2021 price prediction puts ETH around $2,000", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "For a long time, Ethereum has been under the show of Bitcoin, however, things might be taking a different turn. In the last one year, the Ether has seen gains of nearly 800 percent, surpassing that of the number one cryptocurrency.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Many will be quick to link the most recent price rally to the increasing institutional investors in Bitcoin, once again shelving Ethereum to the backline. Was Ethereum designed to forever be in the shadows of Bitcoin? Or will the coin eventually get its break? Here is the case for Ethereum in the coming months.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The Case for Ethereum", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "While both Bitcoin and Ethereum are built using Blockchain technology, they differ in their very root. While Bitcoin is just a currency, Ethereum is a ledger technology that companies use to build new programs.", "\n", "These programs are referred to as decentralized applications. The Ether or ETH is just Ethereum’s coin value. Its ecosystem makes it far more robust than the pioneer crypto.", "\n", "Another important part of this ecosystem is ", "The Enterprise Ethereum Alliance.", " It is a group of Fortune 500 companies in an alliance to work together to learn and build upon Ethereum’s blockchain technology.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Ethereum is Built for Sustainable Growth", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Ethereum proffers the most real-world use among all the digital assets. While Bitcoin may be enjoying the lion’s share of institutional investors, the Ethereum ecosystem is built to help both small and large companies reach their goals.", "\n", "While Ethereum may be the second-largest cryptocurrency at the moment, its strength for sustainability comes from its ecosystem no the ETH. Already, the Ethereum blockchain is the underlying technical infrastructure for projects like:", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "uPort, an Ethereum Dapp that aims to provide a decentralized identity for everybody.", "\n", "Augur, a decentralized prediction market that allows people to create prediction markets.", "\n", "EtherTweet is an Ethereum Dapp that acts as an uncensored messaging platform run.", "\n", "Everex, a platform that supports a P2P payment system pegged to fiat.", "\n", "VeChain Thor, which is perhaps the highlight of all ethereum based projects. It allows the authenticity and quality of any product to be tracked all the way through the supply chain.", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Ethereum has successfully launched over 3,500 decentralized applications. Several of these Dapps are already being used by different industries for more than just payments.", "\n", "In the future, these projects are bound to grow even as more find new use cases and come into the Dapp space. As they grow, the ETH will grow alongside.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Problem Solving With Ethereum", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Very recently, a hospital in Cyprus ", "used a VeChain Thor", " based applications to validate Coronavirus vaccinations. The app was used to certify 100 doctors and nurses in the Mediterranean Hospital, Cyprus.", "\n", "Another Ethereum project, Ethlance, bills itself as the “world’s first job platform running entirely on Ethereum.” Freelancers on the platform pay zero fees for transactions.", "\n", "On the issue of transactions, while Bitcoin takes about 15 minutes to complete a transaction, transactions of the same scale performed with Ethereum are completed under 15 seconds.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "To solve the issue of limited supply and hoarding of ETH, the platform theoretically has an unlimited supply. This will help it maintain the growing number of Dapps on the platform and running out of coins to reward miners.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Ethereum Version 2.0", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the 1st of December, 2020, Ethereum launched its version 2.0 blockchain or, The Beacon Chain. The Beacon Chain introduced proof-of-stake to Ethereum.", "\n", "For now, the Beacon chain exists separately from the Ethereum mainnet, although there are plans for future integration. ", "The Beacon Chain", " is responsible for managing validators, dishing out rewards, and delivering the PoS consensus mechanism.", "\n", "This new version also brings greater energy efficiency, lower barriers to smart contract entry, and an overall fairer playing field for miners and traders.", "\n", "Since the launch of the Beacon Chain, the ETH has risen by more than 100 percent. In addition to the general upward trend of the crypto market, Ethereum has seen more growth, rising to its 3 years high in the process. Ethereum currently trades around $1,300.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the Flipside", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "The crypto market continues to move northbound, with Bitcoin at the forefront of the move.", "\n", "The number one cryptocurrency has once again surpassed its new all-time high to trade at $41,970 per coin.", "\n", "Crypto enthusiasts and analysts are backing the digital asset market for an overall bullish year as institutional investors mount interest in the growing industry.", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Future of Ethereum", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The Beacon Chain is the first of three planned updates to be made to the Ethereum MainNet. The future goal is to create a more secure and scalable Ethereum network. Hence the combination of proof-of-stake to its current proof-of-work approach.", "\n", "The future of Ethereum lies in its Shard chains. Here the network’s load will be spread across 64 new chains. This will make it easier to run a node by keeping hardware requirements low. Shards will give Ethereum more capacity to store and access data.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "The dynamics of Ethereum’s economics will completely change with Ethereum 2.0. In the current Ethereum MainNet, there is a 4 percent per annum inflation rate for the issuance of 1 ETH. However, With ETH 2.0, the inflation rate will supposedly drop down to 0.5%, with respect to validators’ participation.", "\n", "Following the Beacon Chain launch, Ethereum has stated that work is underway to move to this network. The planned morph into Shard Chains is expected to start in 2021. More growth is underway for Ethereum.", "\n", "Ethereum currently floors Bitcoin in the area of transactions and scalability which it plans on improving gradually over the next three years. As this happens, Ethereum will continue to enjoy more finance use cases, eventually eclipsing the current financial system in terms of usage.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Ethereum as the Digital Oil", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "While Bitcoin is referred to as the Digital Gold for being the first and biggest digital asset, Ethereum takes its place as the Digital oil.", "\n", "The Ether is referred to as the ‘digital oil’ because, like crude, it delivers value to its holders based on their fee-generated revenue, just as real-estate dividends or equity dividends.", "\n", "Also, unlike gold, the digital crude as a store of value will significantly more useful and more programmable. The Ether checks all those boxes. The planned three use-cases for the Ether.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "Consumable Asset:", " Already the ETH is required to pay for transactions or other forms of computation on the Ethereum network.", "\n", "Capital Asset:", " Its planned network upgrade will make the ETH a capital asset. What this means is that the ETH will soon be a requirement for block producers to have the right to propose and attest to blocks. As the network grows, the ETH will become an indispensable part of the Dapp ecosystem.", "\n", "The ETH is used as collateral for protocols and applications built on top of Ethereum. The Ether acts as collateral for every Dapp or project launched on the network.", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Upon completion of the Ethereum 2.0 network, the Ether will become the first triple-point asset. Because of the Ether’s numerous use cases, it is bound to grow into a state-free, global money market capable of surpassing that of gold.", "\n", "One area where the asset has been criticized for its lack of an underlying hard asset; or its value has no basis in the real world.", "\n", "However, the problem is being solved by the influx of projects into the Dapps ecosystem. Furthermore, the new platform Ethereum is migrating to would solidify Ethereum as a usable asset.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "2021 Price Prediction for Ethereum", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "When placed side by side with any digital asset, Ethereum comes out almost unscathed for being a network capable of solving multiple problems. If Ethereum solves its problem of underlying assets – through strategic partnerships as well as institutional investments, the ETH could solidly plant its flag on the moon.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "As investors are beginning to understand the scope of the Ethereum network, more analysts are giving their predictions on the asset. For example, Blocktown Capital’s managing partner, James Todaro, has a high expectation for the Ether in 2021. His 2021 ethereum price prediction puts the Ether at a value of $9,000.", "\n", "An analysis performed by DigitalCoinPrice put the price of 1 Ether at $1493 at the end of 2021. However, as at the time of this writing, an Ether is currently trading around $1,300. Less than $200 less. This shows just how much impact the December launch had on Ethereum.", "\n", "As the new Ethereum platform develops, we are backing the Ether to rise up to $1,500 in the near term and between $2,500 – $4,000 by the end of 2021.", "\n", "All this is attainable depending on how efficiently it manages its upgrade as well as the performance of the projects currently utilizing its technology.", "\n", "The real value of Ethereum lies in the far future. In the long run, Ethereum could own the crypto space because it is the clear leader to become the most useful blockchain. The bigger its ecosystem grows, the more value the Ether is bound to accumulate.", "\n", "By 2022, Ethereum will be launching its derivative product. The development of Ethereum 2.0 began back in 2017, making its launch very anticipated, and slightly overdue.", "\n", "So, by next year there will likely be more institutional funds coming into the Ethereum marketplace, thus the price of ETH is very likely to see a massive rise.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Disclaimer: Investing in digital assets or related tokens is highly speculative, and this is by no means investment advice. This analysis of Ethereum is based on history, happening events, and speculation ", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "In Conclusion", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "When placed side by side with any digital asset, Ethereum comes out almost unscathed for being a network capable of solving multiple problems. If Ethereum solves its problem of underlying assets – through strategic partnerships as well as institutional investments, the ETH could solidly plant its flag on the moon.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "January 10, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Altcoin News", "title": "Ethereum is Gathering Even More Steam: What to Expect in the Coming Weeks", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "The Ether has hit a new all-time high as the second-largest crypto continues to gather momentum", "\n", "The Ether now trades on the Chicago Mercantile Exchange CME, shortly after which it hit a new ATH", "\n", "Ethereum has defied all odds and looks set to continue its upward movement", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "The second-largest crypto, Ethereum, has set new all-time high following days of gathering momentum. The Ether (ETH) today reached a new height after it launched on the Chicago Mercantile Exchange.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Reason for The Momentum", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The price of the Ether (ETH) , the native crypto of Ethereum, has hit a record-high on CME launching dedicated futures. ETH rallied to as high as $1,830 just hours after it started to trade on CME.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Similar Yet So Different", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The timing of the Ether’s rally to a new record-high is similar to an event involving Bitcoin. In December 2017, the CME listed the Bitcoin futures contract for the first time. Within weeks of reaching a new high, the price of Bitcoin slumped from $20,000 to $6,000.", "\n", "Many traders and analysts followed the same pattern to be repeated by Ether after its futures went live. However, that may not be the case. However, there is no way to judge that the CME Bitcoin futures listing was the catalyst that resulted in Bitcoin’s plummet in the weeks that followed.", "\n", "On February 8, ETH went live under the ticker ETH1, opening at $1669.75, with over 20 contracts traded within the first eight minutes of trading. By the end of the trading day, it registered 388 contracts, which accounts for 19,400 ETH, or $33 million as at the price on February 8.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the Flipside", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "Ripple’s has lost its place as the 4th largest Cryptocurrency by market cap", "\n", "After a spike in the price of Cardano (ADA), the coin overtook Ripple’s XRP which has suffered from the SEC lawsuit", "\n", "Cardano currently trades at $0.68 with a market cap of $21.4 billion which makes it the 4th largest crypto", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Institutional Interest In Ethereum", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Of all the Cryptos, Bitcoin has enjoyed the most share of institutional investment. With the likes of Grayscale, ", "Massmutual", ", ", "MicroStrategy", ", ", "Fidelity Investments", ", ", "Ruffer Investment,", " and ", "Guggenheim Partners LLC", " backing Bitcoin.", "\n", "Unlike Bitcoin in 2017, Ethereum in 2021 has seen an unprecedented institutional demand for Ether and other cryptos. As recently reported, electric car manufacturers Tesla purchased $1.5 billion worth of Bitcoin, which is nearly 10% of its cash holdings.", "\n", "Ryan Seans Adams, an Ethereum investor and researcher, said:", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "ETH futures go live on the CME today This is huge. This is a bridge to institutions. This is a green light from U.S regulators. ETH is becoming globally accepted commodity money.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "What to Expect in the Coming Days?", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "While Ethereum currently trades above $1,800, crypto researchers and analysts believe that its CME listing will act as a catalyst for the price of the Ether. The research team at CoinMetrics noted that CME’s ETH futures launch could accelerate inflows of ETH into the Grayscale Ethereum Trust (ETHE).", "\n", "If the institutional interest for Ethereum rises as a result and Grayscale inflows spike, we could be looking at both a short-term and long-term upward price movement for the Ether.", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "February 10, 2021", "author": "by DailyCoin"},
{"main_url": "https://dailycoin.com/", "name_of_group": "Altcoin News", "title": "An Altcoin Shakeout is Imminent, and There’s A Sleeping Giant Among the Altcoins – Top Trader Says", "text": ["\n\t", "\n\t\t", "\n\t\t\t", "\n", "A top crypto trader has predicted the imminent shakeout of altcoins", "\n", "He also notes that Syntropy (NOIA) is the sleeping giant among altcoins", "\n", "The trader has bet on the privacy-oriented crypto project hitting $1.00 soon", "\n", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "As the crypto market consolidates after a stellar run that saw many cryptos set a new record high, a top crypto trader has come out with his predictions on what the market will look like in the coming days.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "An Altcoin Shakeout is Imminent", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Although many altcoin markets have seen major gains in 2021, there is still a repeat of market dominance. As of press time, the crypto market is valued at approximately $1.45 trillion.", "\n", "Bitcoin accounts for 61.6 percent of that value. Together with Ethereum, both cryptos hold 75.7 percent of the market cap of the entire market. A market with over 8,400 other crypto coins and tokens.", "\n", "A popular crypto trader, known in the industry as ", "Capo", ", has predicted that altcoins are due for a significant correction in the short term. Capo made a name for himself when he called the March Bitcoin bottom.", "\n", "Capo who is a pseudonymous crypto trader has opined that he (they) believe that altcoins will witness a major inflow of capital shifting the dominance of the crypto market. However, for that to be the case, there needs to be a significant pullback in the market.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "More Dips Before the Altcoins", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Although the euphoria of the last major bull run still lingers in the air, many cryptos have begun to consolidate or even retrace. Over the last 24 hours, the market has shed roughly $100 billion of its value as Bitcoin and other altcoins pull back from their newly set all-time high.", "\n", "With this, the famed crypto trade ", "emphasized", " that investors are not quite ready to bet more on altcoins. Before that will happen, there will be more blood in the market, a signal for more retracement.", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "On the Flipside", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "\n", "New research has shown that criminals are using a small group of cryptocurrency brokers and services to launder hundreds of millions of dollars of dirty virtual money", "\n", "According to Chainalysis, just 270 cryptocurrency addresses received $1.3 billion in illicit digital coins last year, many of which were connected to over-the-counter brokers", "\n", "This represents 55 percent of all illegal crypto money flows identified by the U.S. blockchain security firm", "\n", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "Altcoins to Lead the Resurgence", "\n\n\t\t", "\n\t", "\n\n\t", "\n\t\t", "\n\t\t\t", "The acclaimed crypto trader pointed out some cryptos that will be bullish when the altcoin shakeout begins. In his opinion, Band Protocol (BAND), supply chain management tool VeChain (VET), Elrond (EGLD), and DeFi project Fantom (FTM) will be some of the most bullish cryptos.", "\n", "For the sleeping giant amidst the horde of cryptos, Capo notes that they are keeping a close eye on the little-known asset, Syntropy (NOIA). The trader bets that the privacy-oriented crypto project is bound to hit $1.00, representing a 284.62% increase from its current price of $0.26.", "\n", "Finally, Capo told his followers on the microblogging site, Twitter, that there will be another shakeout after Bitcoin reaches the $59,000-$62,000 range. How long do you think it will take before bitcoin crosses the $50K mark?", "\n\n\t\t", "\n\t", "\n", "\n\t", "\n", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "\n\t\t", "\n\t", "\n", "\n\t", "\n\t\t", "\n\t\t\t", "Get awesome crypto content", "\n\n\t\t", "\n\t", "\n", "\n", " ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Subscribe and let us do the rest", "\n  ", "\n    ", "\n  ", "\n  ", "\n    ", "\n  ", "\n"], "date": "February 13, 2021", "author": "by DailyCoin"}
]